<template>
  <div class="mt-10" dir="rtl">
    <h3 style="margin-right: 200px; direction: rtl; margin-bottom: 10px;">
      فیلم های به روز
    </h3>
    <section class="ma-auto mb-16 " style="width: 80%; height: 900px;">
      <v-list>

        <v-list-item @click="goToFilmDetails(film)" v-for="film in films" :key="film.id"
          style="display: inline-block;" class="item">
          <v-list-item-avatar>
            <v-img :src="getSrc(film.id)" :alt="film.name" width="200px" height="auto"></v-img>
          </v-list-item-avatar>
          <v-list-item-content>
            <v-list-item-title style="color: black;">{{ film.name }}</v-list-item-title>
          </v-list-item-content>
        </v-list-item>

      </v-list>
    </section>
  </div>
</template>

<script>
import { ref } from 'vue';
import image1 from '@/assets/images/hotel.jpeg'
import image2 from '@/assets/images/jangal.jpeg'
import image3 from '@/assets/images/fosil.jpeg'
import image4 from '@/assets/images/gijgah.jpeg'
import image5 from '@/assets/images/zerang.jpeg'
import image6 from '@/assets/images/hert.jpeg'
import image7 from '@/assets/images/aame.jpeg'
import image8 from '@/assets/images/8sobh.jpeg'
import image9 from '@/assets/images/jooje.jpeg'
import photoA1 from '@/assets/Film1/ac1.jpg';
import photoA2 from '@/assets/Film1/ac2.jpg';
import photoA3 from '@/assets/Film1/ac3.jpg';
import backPhoto from '@/assets/Film1/back.jpeg';
import filmPhoto from '@/assets/images/fosil.jpeg';
import photoC1 from '@/assets/cinema1/1.jpg';
import photoC2 from '@/assets/cinema1/2.jpg';
import photoC3 from '@/assets/cinema1/3.jpg';
import { useRouter } from 'vue-router';
export default {
  setup() {
    // const items = ref([
    //   {
    //     id: 1,
    //     image: image1,
    //     caption: 'هتل',
    //     duration: 85,
    //     background: image1,
    //     mainPhoto: image1,
    //     title: 'فیلم هتل',
    //     director: 'مسعود اطیابی ',
    //     genre: 'کمدی',
    //     score: '4.5/5',
    //     description: 'فیلم هتل به کارگردانی مسعود اطیابی و تهیه‌کنندگی محمد شایسته با بازی پژمان جمشیدی، محسن کیایی است. ریما رامین‌فر، صدف اسپهبدی، مهلقا باقری، غلامرضا نیکخواه، مریم وحیدزاده، فرزانه قاسم‌زاده، جواد پولادی و سام نوری نیز سایر بازیگران هتل هستند.',
    //     summery: 'کی بهشت رو ول می‌کنه بره جهنم؟!\nفیلم هتل یک کمدی مفرح است و ماجراهای چند مهمان ناخوانده در یک هتل را روایت می‌کند. چند مرد و زن وارد یک هتل شده به صورت اتفاقی یکدیگر را ملاقات کرده و ماجراهایی کمدی را رقم می‌زنند.',
    //     actors: [
    //       {
    //         name: 'پژمان جمشیدی',
    //         photo: photoA1,
    //       },
    //       {
    //         name: 'محسن کیایی ',
    //         photo: photoA2,
    //       },
    //       {
    //         name: 'صدف اسپهبدی ',
    //         photo: photoA3,
    //       }
    //     ],
    //     cast: [
    //       'پژمان جمشیدی',
    //       'محسن کیایی',
    //       'صدف اسپهبدی',
    //       'ریما رامین فر',
    //       'مه لقا باقری',
    //       'غلام رضا نیکخواه',
    //       'مریم وحید زاده',
    //       'فرزانه قاسم زاده',
    //       'جواد پولادی',
    //       'سام نوری'
    //     ],
    //     Comments: [
    //       {
    //         comment: 'به معنای واقعی کلمه عالی بود ، هم موضوعش خوب بود هم این که خنده و کمدی بود',
    //         name: 'ناشناس'
    //       },
    //       {
    //         comment: 'فک میکنم انقد رو پرده سینماها بمونه ک با نوه هامونم باید بریم بازم فیلم رو ببینیم',
    //         name: 'مهتاب نجفی'
    //       }
    //     ]

    //   },
    //   {
    //     id: 2,
    //     image: image2,
    //     caption: 'جنگل پرتقال',
    //     duration: 90,
    //     background: image2,
    //     mainPhoto: image2,
    //     title: 'فیلم جنگل پرتقال',
    //     director: 'آرمان خوانساریان',
    //     genre: 'درام',
    //     score: '3.9/5',
    //     description: 'فیلم جنگل پرتقال نویسندگی و کارگردانی آرمان خوانساریان و محصول سال 1401 است. سارا بهرامی، میرسعید مولویان، رضا بهبودی، رضا عموزاد، فراز سرابی، داوود فتحعلی بیگی، فرشته مرعشی، ارشیا نیک‌بین، حمیدرضا عباسی، زینب شعبانی و حسام نورانی بازیگران این فیلم هستند.',
    //     summery: 'سهراب بهاریان نمایشنامه‌نویس ناموفق بعد از سال‌ها بیکاری معلم دبیرستان شده، او برای حفظ شغل تازه‌اش ناگزیر به ارائه اصل مدرک تحصیلی است. سهراب بعد از ۱۵ سال به شهر دانشجویی‌اش بازمی‌گردد اما این سفر آنطور که او فکر می‌کرده پیش نمی‌رود…',
    //     actors: [
    //       {
    //         name: 'بهرام افشاری',
    //         photo: photoA1,
    //       },
    //       {
    //         name: 'هادی کاظمی',
    //         photo: photoA2,
    //       },
    //       {
    //         name: 'الناز حبیبی',
    //         photo: photoA3,
    //       }
    //     ],
    //     cast: [
    //       'سارا بهرامی',
    //       'میرسعید مولویان',
    //       'رضا بهبودی',
    //       'رضا عموزاد',
    //       'فراز سرایی',
    //       'فرشته مرعشی',
    //       'ارشیا نیک بین'
    //     ],
    //     Comments: [
    //       {
    //         comment: 'به معنای واقعی کلمه عالی بود ، هم موضوعش خوب بود هم این که خنده و کمدی بود',
    //         name: 'ناشناس'
    //       },
    //       {
    //         comment: 'فک میکنم انقد رو پرده سینماها بمونه ک با نوه هامونم باید بریم بازم فیلم رو ببینیم',
    //         name: 'مهتاب نجفی'
    //       }
    //     ]
    //   },
    //   {
    //     id: 3,
    //     image: image3,
    //     caption: 'فسیل',
    //     duration: 85,
    //     background: image3,
    //     mainPhoto: image3,
    //     title: 'فیلم فسیل',
    //     director: 'کریم امینی',
    //     genre: 'کمدی',
    //     score: '4.5/5',
    //     description: 'فیلم فسیل به کارگردانی کریم امینی و تهیه‌کنندگی ابراهیم عامریان است. بهرام افشاری، هادی کاظمی، الناز حبیبی، الهه حصاری، ایمان صفا، بابک کریمی، سیدجواد هاشمی و ... در این فیلم کمدی ایفای نقش کرده‌اند.',
    //     summery: 'با فسيل به دهه پنجاه سفر كنيد...',
    //     actors: [
    //       {
    //         name: 'بهرام افشاری',
    //         photo: photoA1,
    //       },
    //       {
    //         name: 'هادی کاظمی',
    //         photo: photoA2,
    //       },
    //       {
    //         name: 'الناز حبیبی',
    //         photo: photoA3,
    //       }
    //     ],
    //     cast: [
    //       'بهرام افشاری',
    //       'هادی کاظمی',
    //       'الناز حبیبی',
    //       'الهه حصاری',
    //       'ایمان صفا',
    //       'بابک کریمی',
    //       'غلامرضا نیکخواه',
    //       'جواد هاشمی',
    //       'امید روحانی',
    //       'علیرضا استادی',
    //       'خشایار راد',
    //       'قاسم زارع',
    //     ],
    //     Comments: [
    //       {
    //         comment: 'به معنای واقعی کلمه عالی بود ، هم موضوعش خوب بود هم این که خنده و کمدی بود',
    //         name: 'ناشناس'
    //       },
    //       {
    //         comment: 'فک میکنم انقد رو پرده سینماها بمونه ک با نوه هامونم باید بریم بازم فیلم رو ببینیم',
    //         name: 'مهتاب نجفی'
    //       }
    //     ]
    //   },
    //   {
    //     id: 4,
    //     image: image4,
    //     caption: 'گیجگاه',
    //     duration: 105,
    //     background: image4,
    //     mainPhoto: image4,
    //     title: 'فیلم گیجگاه',
    //     director: 'عادل تبریزی',
    //     genre: 'عاشقانه',
    //     score: '2.8/5',
    //     description: 'فیلم گیج‌گاه نخستین فیلم عادل تبریزی محصول سال 1399 است که در آن بازیگرانی همچون جمشید هاشم‌پور، حامد بهداد، باران کوثری، سروش صحت، فرهاد آییش ایفای نقش می‌کنند. این فیلم در سی‌و‌نهمین جنشواره‌ی فیلم فجر نیز حضور داشت و در دو بخش بهترین تدوین و بهترین کارگردان فیلم اولی، نامزد دریافت سیمرغ شد. ',
    //     summery: 'آشنایی زنی به نام مهتاب و مردی به نام حسن خشنود، شبیه قصه‌هاست، شبیه زندگی، شبیه سینما، شبیه روزگاری که خوش می‌‌گذشت...',
    //     actors: [
    //       {
    //         name: 'حامد بهداد',
    //         photo: photoA1,
    //       },
    //       {
    //         name: 'باران کوثری',
    //         photo: photoA2,
    //       },
    //       {
    //         name: 'سروش صحت',
    //         photo: photoA3,
    //       }
    //     ],
    //     cast: [
    //       'حامد بهداد',
    //       'باران کوثری',
    //       'سروش صحت',
    //       'بهرنگ علوی ',
    //       'امیرحسین رستمی',
    //       'نادر سلیمانی',
    //       'بیژن بنفشه خواه ',
    //       'سیاوش چراغی پور '
    //     ],
    //     Comments: [
    //       {
    //         comment: 'به معنای واقعی کلمه عالی بود ، هم موضوعش خوب بود هم این که خنده و کمدی بود',
    //         name: 'ناشناس'
    //       },
    //       {
    //         comment: 'فک میکنم انقد رو پرده سینماها بمونه ک با نوه هامونم باید بریم بازم فیلم رو ببینیم',
    //         name: 'مهتاب نجفی'
    //       }
    //     ]
    //   },
    //   {
    //     id: 5,
    //     image: image5,
    //     caption: 'بچه زرنگ',
    //     duration: 85,
    //     background: image5,
    //     mainPhoto: image5,
    //     title: 'فیلم بچه زرنگ',
    //     director: ' ',
    //     genre: 'ماجراجویی',
    //     score: '4.2/5',
    //     description: 'انیمیشن سینمایی بچه زرنگ ساخته گروه هنرپویا به تهیه کنندگی حامد جعفری، درباره‌ ماجرای پسر بچه‌ای به نام محسن است که خود را ابرقهرمان می‌داند و در یک اتفاق نادر، به جنگلی اسرار آمیز قدم می‌گذارد و با حیوانات منقرض شده ایران مواجه می‌شود… این آغاز یک ماجرای پیچیده برای نجات آخرین ببر ایرانی. ',
    //     summery: 'صداپیشگان این فیلم عبارت‌اند از: سعید شیخ‌زاده، هومن حاجی‌عبداللهی، هدایت هاشمی، میرطاهر مظلومی، ژرژ پطروسی، جواد پزشکیان، مینا قیاس‌پور، مریم رادپور، تورج نصر، اردشیر منظم، مهسا عرفانی، ابراهیم شفیعی، همت مومی‌وند، .شایان شامبیاتی، حسن کاخی، امیر حکیمی، نازنین یاری، علیرضا دیباج، متانت اسماعیلی، پویا فهیمی. این فیلم محصول مشترک کانون و گروه هنرپویاست.',
    //     actors: [
    //       {
    //         name: 'هومن جاجی عبداللهی',
    //         photo: photoA1,
    //       },
    //       {
    //         name: 'سعید شیخ زاده',
    //         photo: photoA2,
    //       },
    //       {
    //         name: 'هدایت هاشمی',
    //         photo: photoA3,
    //       }
    //     ],
    //     cast: [
    //       'هومن جاجی عبداللهی',
    //       'سعید شیخ زاده',
    //       'هدایت هاشمی',
    //       'میرطاهر مظلومی',
    //       'ژرژ پطروسی',
    //     ],
    //     Comments: [
    //       {
    //         comment: 'به معنای واقعی کلمه عالی بود ، هم موضوعش خوب بود هم این که خنده و کمدی بود',
    //         name: 'ناشناس'
    //       },
    //       {
    //         comment: 'فک میکنم انقد رو پرده سینماها بمونه ک با نوه هامونم باید بریم بازم فیلم رو ببینیم',
    //         name: 'مهتاب نجفی'
    //       }
    //     ]
    //   },
    //   {
    //     id: 6,
    //     image: image6,
    //     caption: 'شهر هرت',

    //     duration: 95,
    //     background: image6,
    //     mainPhoto: image6,
    //     title: 'فیلم شهر هرت',
    //     director: 'مسعود اطیابی ',
    //     genre: 'کمدی',
    //     score: '4.5/5',
    //     description: 'فیلم شهر هرت به کارگردانی کریم امینی و تهیه‌کنندگی محمدحسین فرح‌بخش است و ژانری کمدی دارد. پژمان جمشیدی، شبنم مقدمی و بابک کریمی بازیگران اصلی این فیلم را شامل می‌شوند.',
    //     summery: '',
    //     actors: [
    //       {
    //         name: 'پژمان جمشیدی',
    //         photo: photoA1,
    //       },
    //       {
    //         name: 'شبنم مقدمی ',
    //         photo: photoA2,
    //       },
    //       {
    //         name: 'بابک کریمی ',
    //         photo: photoA3,
    //       }
    //     ],
    //     cast: [
    //       'پژمان جمشیدی',
    //       'شبنم مقدمی ',
    //       'بابک کریمی ',
    //       'اکبر رحمتی'

    //     ],
    //     Comments: [
    //       {
    //         comment: 'به معنای واقعی کلمه عالی بود ، هم موضوعش خوب بود هم این که خنده و کمدی بود',
    //         name: 'ناشناس'
    //       },
    //       {
    //         comment: 'فک میکنم انقد رو پرده سینماها بمونه ک با نوه هامونم باید بریم بازم فیلم رو ببینیم',
    //         name: 'مهتاب نجفی'
    //       }
    //     ]
    //   },
    //   {
    //     id: 7,
    //     image: image7,
    //     caption: 'عامه پسند',
    //     duration: 90,
    //     background: image7,
    //     mainPhoto: image7,
    //     title: 'فیلم عامه پسند ',
    //     director: 'سهیل بیرقس ',
    //     genre: 'اجتماعی',
    //     score: '3.3/5',
    //     description: 'فیلم عامه پسند به نویسندگی، کارگردانی و تهیه‌کنندگی سهیل بیرقی، محصول سال 1398 است. فاطمه معتمدآریا، هوتن شکیبا و باران کوثری بازیگران اصلی این فیلم هستند.',
    //     summery: 'فیلم روایتگر داستان زنی‌ست که تصمیم می‌گیرد پس از سال‌ها زندگی مشترک همسرش را ترک کند و در شهر کوچکی ساکن شود. این تصمیم چالش‌های تازه‌ای را وارد‌ زندگی زن می‌کند.',
    //     actors: [
    //       {
    //         name: 'فاطمه معتمد آریا',
    //         photo: photoA1,
    //       },
    //       {
    //         name: 'هوتن شکیبا ',
    //         photo: photoA2,
    //       },
    //       {
    //         name: 'باران کوثری ',
    //         photo: photoA3,
    //       }
    //     ],
    //     cast: [
    //       'فاطمه معتمد آریا',
    //       'هوتن شکیبا ',
    //       'باران کوثری ',

    //     ],
    //     Comments: [
    //       {
    //         comment: 'به معنای واقعی کلمه عالی بود ، هم موضوعش خوب بود هم این که خنده و کمدی بود',
    //         name: 'ناشناس'
    //       },
    //       {
    //         comment: 'فک میکنم انقد رو پرده سینماها بمونه ک با نوه هامونم باید بریم بازم فیلم رو ببینیم',
    //         name: 'مهتاب نجفی'
    //       }
    //     ]
    //   },
    //   {
    //     id: 8,
    //     image: image8,
    //     caption: 'حدود هشت صبح',
    //     duration: 90,
    //     background: image8,
    //     mainPhoto: image8,
    //     title: 'فیلم حدود هشت صبح',
    //     director: 'منوچهر هادی',
    //     genre: 'اجتماعی',
    //     score: '3.4/5',
    //     description: 'فیلم حدود 8 صبح به کارگردانی منوچهر هادی و تهیه‌کنندگی محمدصادق رنج‌کشان است. یکتا ناصر، کامبیز دیرباز، سارا رسول‌زاده، حسن پورشیرازی و منوچهر هادی بازیگران این فیلم سینمایی هستند. این فیلم که بر اساس یک داستان واقعی و ملتهب ساخته شده است و ژانری اجتماعی دارد.',
    //     summery: '',
    //     actors: [
    //       {
    //         name: 'حمید فرخ نژاد',
    //         photo: photoA1,
    //       },
    //       {
    //         name: 'یکتا ناصر',
    //         photo: photoA2,
    //       },
    //       {
    //         name: 'کامبیز دیرباز',
    //         photo: photoA3,
    //       }
    //     ],
    //     cast: [
    //       'حمید فرخ نژاد',
    //       'یکتا ناصر',
    //       'کامبیز دیرباز',
    //       'سارا رسول زاده'

    //     ],
    //     Comments: [
    //       {
    //         comment: 'به معنای واقعی کلمه عالی بود ، هم موضوعش خوب بود هم این که خنده و کمدی بود',
    //         name: 'ناشناس'
    //       },
    //       {
    //         comment: 'فک میکنم انقد رو پرده سینماها بمونه ک با نوه هامونم باید بریم بازم فیلم رو ببینیم',
    //         name: 'مهتاب نجفی'
    //       }
    //     ]
    //   },
    //   {
    //     id: 9,
    //     image: image9,
    //     caption: 'جوجه تیغی',
    //     duration: 101,
    //     background: image9,
    //     mainPhoto: image9,
    //     title: 'فیلم جوجه تیغی',
    //     director: 'مستانه مهاجر',
    //     genre: 'کمدی',
    //     score: '3.1/5',
    //     description: "فیلم جوجه تیغی نخستین فیلم مستانه مهاجر به عنوان کارگردان است. حامد کمیلی، پانته‌آ پناهی‌ها، هادی کاظمی، آناهیتا درگاهی، نازنین بیاتی و پژمان بازغی بازیگران اصلی این فیلم هستند.",
    //     summery: "ماجرایی طنز از زندگی ناخواسته یک جوان متعصب‌ را روایت می‌کند که پیشنهادی عجیب، گذشته و آینده‌‌ او را تحت‌تاثیر قرار می‌دهد و از سوی دیگر ماجراهای زنی که می‌خواهد اولین رئیس جمهور زن ایران شود.",
    //     actors: [
    //       {
    //         name: 'حامد کمیلی',
    //         photo: photoA1,
    //       },
    //       {
    //         name: 'پانته آ پناهی',
    //         photo: photoA2,
    //       },
    //       {
    //         name: 'هادی کاظمی',
    //         photo: photoA3,
    //       }
    //     ],
    //     cast: [
    //       'حامد کمیلی',
    //       'پانته آ پناهی',
    //       'آناهیتا درگاهی',
    //       'هادی کاظمی',

    //     ],
    //     Comments: [
    //       {
    //         comment: 'به معنای واقعی کلمه عالی بود ، هم موضوعش خوب بود هم این که خنده و کمدی بود',
    //         name: 'ناشناس'
    //       },
    //       {
    //         comment: 'فک میکنم انقد رو پرده سینماها بمونه ک با نوه هامونم باید بریم بازم فیلم رو ببینیم',
    //         name: 'مهتاب نجفی'
    //       }
    //     ]
    //   }
    // ]);


    const films = ref([])
      fetch('http://185.128.40.150:8080/api/movies')
        .then(response => response.json())
        .then(data => films.value = data.movies)
    const router = useRouter();

    const goToFilmDetails = (film) => {
      router.push({ name: 'Film', params: { id: film.id } });
    };

      const getSrc = (id) => {
          const src = `/src/assets/images/${id}.jpeg`
          return src;
      }

    return {
      films, goToFilmDetails,getSrc
    };
  }
};
</script>
<style>
.item {
  transition: transform .2s;
}

.item:hover {
  transform: scale(1.1);
}
</style>
