<template>
  <v-container>
    <v-card>
      <v-card-title>
        <h2 class="text-right mb-6">سینماها</h2>
      </v-card-title>
      <div class="list">
        <v-row>
          <v-col v-for="(cinema, index) in cinemas" :key="index" cols="12" sm="6" md="4" lg="3">
            <v-card @click="goToCinemaDetails(cinema)" class="cinema-card item">
              <v-img :src="cinema.image" :alt="cinema.name" class="cinema-image"></v-img>
              <v-card-title class="text-right mb-1">{{ cinema.name }}</v-card-title>
              <v-card-text class="text-right mb-1">
                <div class="mb-2">{{ cinema.location }} <v-icon>mdi-map-marker</v-icon></div>
                <div>{{ cinema.score }} <v-icon size="small">mdi-checkbox-marked-circle</v-icon> </div>
              </v-card-text>
            </v-card>
          </v-col>
        </v-row>
      </div>
    </v-card>
  </v-container>
</template>

<script>
import { ref } from 'vue';
import image1 from '@/assets/cinema1/1.jpg'
import image2 from '@/assets/cinema1/2.jpg'
import image3 from '@/assets/cinema1/3.jpg'
import image4 from '@/assets/cinema1/4.jpg'
import image5 from '@/assets/cinema1/5.jpg'
import image6 from '@/assets/cinema1/6.jpg'
import image7 from '@/assets/cinema1/7.jpg'
import image8 from '@/assets/cinema1/8.jpg'
import '@mdi/font/css/materialdesignicons.css'
import { useRouter } from 'vue-router';


export default {
  setup() {
    const cinemas = ref([
      {

        id: 1,
        name: ' پردیس سینمایی کوروش',
        location: 'اتوبان همت غرب، ستاری شمال',
        score: '3.6',
        image: image1,
        features: [
          {
            value: 'کافی شاپ',
            icon: 'mdi-coffee',
          },
          {
            value: 'فود کورت',
            icon: 'mdi-food',
          },
          {
            value: 'پارکینگ',
            icon: 'mdi-parking',
          }

        ],
        contact: '02144971930',
        description: 'پردیس سینمایی کوروش، بزرگترین پردیس سینمایی کشور در طبقات4و6 مجتمع تجاری، فرهنگی و تفریحی کورش با سرمایه گذاری گروه صنعتی گلرنگ طی چهارسال ساخته شده است. 16000متر مربع از مجتمع تجاری، فرهنگی و تفریحی پردیس کورش به 12 سالن سینما اختصاص داده شده که 2800 صندلی به ظرفیت سینماهای کشور اضافه کرده است. پردیس سینمایی کورش کار خود را در ۲۷ مرداد ۱۳۹۳ با اکران فیلم سینمایی شهر موش ها 2 آغاز کرد. نام سالن های سینما کوروش به یاد سینماهای خیابان لاله زار تهران گذاشته شده اند. همچنین این سینما دارای رستورانهای گوناگون و پارکینگ نیز میباشد.',
        Comments: [
          {
            comment: 'بهترین پردیس سینمایی ،عالیییی',
            name: 'ناشناس'
          },
          {
            comment: 'امیدوارم مثل چندسال پیش مجدد فیلم خارجی اکران کنین..واقعا فیلمهایی مثل اپنهایمر-فارست گامپ -پیانیست- ارباب حلقه ها و خیلی های دیگه که ارزش چندبار دیدن رو دارن بهتره اکران کنین',
            name: 'مهتاب نجفی'
          }
        ]

      },
      {
        id: 2,
        name: 'پردیس سینمایی ایران مال',
        location: 'اتوبان همت غرب، اتوبان خرازی',
        score: '4.0',
        image: image2,
        features: [
          {
            value: 'کافی شاپ',
            icon: 'mdi-coffee',
          },
          {
            value: 'فود کورت',
            icon: 'mdi-food',
          },
          {
            value: 'پارکینگ',
            icon: 'mdi-parking',
          }

        ],
        contact: '021-46020120',
        description: 'مجموعه سینمایی بازار بزرگ ایران در جشنواره فیلم فجر سی وهفتم با نمایش فیلم مسخره باز به کارگردانی همایون غنی زاده به عنوان مدرنترین سینمای کشور شروع به فعالیت کرد.مجموعه پیشرفته سینمایی بازار بزرگ ایران با 12 سالن و ظرفیت بیش از 1800 نفر شامل 9 سالن جهت اکران فیلم های روز و 3 سالن اختصاصی خانوادگی هر یک به ظرفیت 17 نفر با امکانات ویژه و امکان انتخاب فیلم مورد نظر برای مخاطبان گرامی است.مساحت کلی این پردیس 5700 متر مربع میباشد. امکان ساپورت تکنولوژی(بزرگترین اندازه و بالاترین وضوح تصویر در پرده نمایش ) و همچنین سیستم تصویری 4K/RGB LASER ;که در کشور منحصر به فرد میباشد. سیستم صوتی فوق مدرن AROUMAX شرکت BARCO بلژیک (پخش صوتی 1به 10 ، ا به 7) که در کشور منحصر به فرد میباشد.تعداد221 صندلی این پردیس قابلیت تنظیم موتورایز زیر پایی و زاویه تکیه گاه را دارا میباشد.امکان استفاده از اتوماسیون و سیستم TMS یا مدیریت متمرکز کنترل پخش فیلم بصورت دریافت مستقیم از ماهواره و پخش همزمان در اکرانهای جهانی از افتخارات این سینماست.',
        Comments: [
          {
            comment: 'کیفیت سینما عالی بود',
            name: 'پ د'
          },
          {
            comment: 'سینمای بسیار خوبیه فقط متاسفانه تعداد کمی از فیلم ها ساعت خوب اکران نمیشه که اونم قابل اغماضه. مرسی ایران مال',
            name: 'سجاد سجادیان'
          }
        ]
      },
      {
        id: 3,
        name: 'پردیس سینمایی آزادی',
        location: 'خیابان بهشتی',
        score: '3.3',
        image: image3,
        features: [
          {
            value: 'کافی شاپ',
            icon: 'mdi-coffee',
          },
          {
            value: 'فود کورت',
            icon: 'mdi-food',
          },
          {
            value: 'پارکینگ',
            icon: 'mdi-parking',
          }

        ],
        contact: '021-84480',
        description: 'روز سوم اردیبهشت ۱۳۴۸، سینما شهر فرنگ با اکران فیلم مارلیک افتتاح شد. برادران روحانی (صاحبان سینما) مدتی بعد، از نام خارجی برادوی صرف نظر کرده و ترجیح دادند نام سینمایشان یادآور دستگاه سرگرم کننده دوران کودکی شان باشد. نمایش فیلم‌های مطرحی مثل جنگ ستارگان باعث شد ضلع شمال شرقی چهار راه عباس آباد و سینما شهر فرنگ، به سرعت به پاتوق دوست داران فیلم بدل شود. منظره همیشگی چهارراه شهید بهشتی در آن دوران، صف‌های طویل در مقابل سینمای شهر فرنگ بود. به طوری که در سال ۱۳۷۵ این سینما با فروش ۱۵۰ میلیون تومانی خود، لقب پرفروش‌ترین سینمای ایران را به خود اختصاص داد. پس از انقلاب‌بعد از انقلاب و در سال ۱۳۵۹، سینمای شهر فرنگ تحت پوشش بنیاد مستضعفان با نام سینما آزادی افتتاح شد. پس از جنگ و بعد از ده سال، سینما به حوزه هنری واگذار شد.سینما آزادی دو بار در سال‌های ۱۳۵۵ و ۱۳۶۹ هم دچار آتش سوزی خفیف شده بود، اما از آتش سوزی فروردین ۱۳۷۶ نتوانست جان سالم به در ببرد. ساعت ۱۳:۱۵ روز جمعه ۲۹ فروردین ۱۳۷۶، کانال‌های سمت راست سالن مشتعل می‌شود. وقتی تماشاچیان مشغول تماشای اولین سانس فیلم کمدی تعطیلات تابستانی بودند، آتش به سرعت در میان تجهیزات پلاستیکی می‌پیچد و دود غلیظ آن، منجر به گریز تماشاچیان می‌شود. شیشه‌ها بر اثر حرارت بر سر مردم خرد شده و در کمتر از ۲۰ دقیقه و با وجود تلاش آتش نشانان، آتش آنجا را به تلی از خاکستر بدل می‌کند. مأموران موفق می‌شوند سینمای شهر قصه را که در نزدیکی آن قرار داشت از آتش سوزی نجات بدهند، ولی چند روز بعد سینمای شهر قصه را هم نیز برای جلوگیری از فروریختن احتمالی دیوارها، تخریب می‌کنند. تا هشت سال پس از آتش سوزی ویرانهای در شرق چهارراه عباس آباد و جنوب خیابان وزرا خودنمایی می‌کند.پس از جنگ تحمیلی اما بالاخره با همت و تلاش مديران دلسوز حوزه هنري و شهرداري تهران مجموعه جديدسینما ازادی با ٥ سالن به ظرفيت ١١٠٠ صندلي با مدرنترين تجهيزات سينمايي روز دنيا اماده بهره برداري ميشود',
        Comments: [
          {
            comment: 'اولین وبهترین پردیس ایران .دسترسی به همه جای تهران وپرسنل بسیارمودب ومثل همیشه فیلمهاسرموقع شروع میشه وآدم میتونه برنامه ریزی دقیق کنه خسته نباشیدبه همه',
            name: 'محمد'
          },
          {
            comment: 'امیدوارم مثل چندسال پیش مجدد فیلم خارجی اکران کنین..واقعا فیلمهایی مثل اپنهایمر-فارست گامپ -پیانیست- ارباب حلقه ها و خیلی های دیگه که ارزش چندبار دیدن رو دارن بهتره اکران کنین',
            name: 'مهتاب نجفی'
          }
        ]
      },
      {
        id: 4,
        name: 'پردیس سینمایی ملت',
        location: 'خیابان ولیعصر، بزرگراه نیایش',
        score: '3.3',
        image: image5,
        features: [
          {
            value: 'کافی شاپ',
            icon: 'mdi-coffee',
          },
          {
            value: 'فود کورت',
            icon: 'mdi-food',
          },
          {
            value: 'پارکینگ',
            icon: 'mdi-parking',
          }

        ],
        contact: '021-23162',
        description: 'پردیس سینما گالری ملت در سال 1387 با 5 سالن سینما، با ظرفیت 1089 صندلی افتتاح شد که طی یک بازنگری و افزایش 7 سالن به آن، این سینما با 12 سالن در بهمن ماه سال 1398 افتتاح شد.پردیس سینما گالری ملت دومین سینپلکس کشور از نظر تعداد صندلی و متعلق به شهرداری تهران که با به روزترین سیستم های نمایش، 1900 صندلی را به ظرفیت سینماهای کشور اضافه کرده است.این پردیس سینمایی دارای 11 سالن سینما در طبقات مثبت یک، همکف، منفی یک و منفی دو، 1 سالن چند منظوره (سینما، تئاتر، موسیقی و همایش) در طبقه منفی دو با ظرفیت 237 صندلی، گالری، کافی شاپ، فودکورت در طبقه مثبت 2 با انواع غذاهای ایرانی و فرنگی و پارکینگ با 200 متر فاصله از مجموعه قرار دارد و با ظرفیت محدود میزبان مخاطبان این سینماست. پارکینگ موتوری افتتاح شد.',
        Comments: [
          {
            comment: 'عالیییی',
            name: 'مهرشاد'
          },
          {
            comment: 'برای پارکینگ یک ساعت زودتر برید سینماشم عالیه فضای معماری بسیار زیبای هنری داره کیفیت صدا و تصویرشم عالیه',
            name: ' مجتبی تهرانی'
          }
        ]
      },
      {
        id: 5,
        name: 'پردیس سینمایی شمیران',
        location: 'اقدسیه، بلوار ارتش',
        score: '4.4',
        image: image4,
        features: [
          {
            value: 'کافی شاپ',
            icon: 'mdi-coffee',
          },
          {
            value: 'فود کورت',
            icon: 'mdi-food',
          },
          {
            value: 'پارکینگ',
            icon: 'mdi-parking',
          }

        ],
        contact: '02140221525',
        description: 'پردیس سینمایی شمیران در تاریخ تیر 1399 در شمال شرق تهران و در محله اقدسیه افتتاح شد. این سینما دارای 5 سالن است که سالن قرمز با ۱۵۴ صندلی، سالن نارنجی با ۹۲ صندلی، سالن آبی با ۴۹ صندلی، سالن سبز با ۳۸ صندلی و سالن وی ‌آی ‌پی با ظرفیت ۳۶ صندلی هستند. تمامی سالن های این سینما مجهز به سیستم پخش به روز و صوت دالبی هستند. همچنین این سینما به نحوی طراحی شده که امکان استفاده معلولان جسمی-حرکتی از این سینما فراهم است.',
        Comments: [
          {
            comment: 'سینمایی راحت سالن ارغوان کوچیک ولی راحت بود',
            name: 'امیر'
          },
          {
            comment: 'عالی و تمیز',
            name: ' ناشناس'
          }
        ]
      },
      {
        id: 6,
        name: 'سینما فرهنگ تهران',
        location: 'خیابان شریعتی، مترو قلهک',
        score: '3.7',
        image: image6,
        features: [
          {
            value: 'کافی شاپ',
            icon: 'mdi-coffee',
          },
          {
            value: 'فود کورت',
            icon: 'mdi-food',
          },
          {
            value: 'پارکینگ',
            icon: 'mdi-parking',
          }

        ],
        contact: '021-22601205',
        description: 'سینما فرهنگ در سال 1348 با نام سیلورسیتی شروع به کار کرد. این سینما در اوایل دههٔ 1380 سینما بازسازی و در 28 آذر 1382 بازگشایی شد. سینما فرهنگ تهران از سینماهای قدیمی و یکی از مجهزترین سینماهای ایران است در تقاطع خیابان شریعتی و خیابان دولت قرار دارد. این سینما دولتی است و زیر نظر بنیاد فارابی اداره می‌شود.',
        Comments: [
          {
            comment: 'یکی از بهترین ها',
            name: 'مبین'
          },
          {
            comment: 'خيلی سینمای خوبیه شیک و مدرن عالی حتما برید بهترین سالن هم سالن ۳ هست',
            name: 'سمیه کشانی'
          }
        ]
      },
      {
        id: 7,
        name: 'پردیس سینمایی زندگی',
        location: 'صادقیه، بلوار کاشانی',
        score: '3.3',
        image: image8,
        features: [
          {
            value: 'کافی شاپ',
            icon: 'mdi-coffee',
          },
          {
            value: 'فود کورت',
            icon: 'mdi-food',
          },
          {
            value: 'پارکینگ',
            icon: 'mdi-parking',
          }

        ],
        contact: '02144014252',
        description: 'پردیس سینمایی زندگی مجموعه‌ای فرهنگی - تجاری در غرب تهران است که دارای پنج سالن سینما، سالن تئاتر، مرکز خرید و رستوران در سال 1388 با ظرفیت 1000 صندلی آغاز به کار کرده است. این مجموعه در بزرگراه آیت‌الله کاشانی، بلوار اباذر قرار دارد و روبه‌روی بیمارستان چشم پزشکی پیامبران واقع شده‌است. این سینما تحت مالکیت شرکت نمایشگران پرده نقره ای قرار دارد. سالن های این سینما مجهز به مدرن ترین سیستم تصویر و صدا به همراه فضایی آرام و دل نشین میزبان علاقه مندان به سینما می باشد.',
        Comments: [
          {
            comment: 'چند سالن سینما در مجتمع تجاری در منطقه آرام در منطقه 5تهران که خیلی دوست دارم اینجا فیلم ببینم هر چند کورش به ما نزدیکه ولی خیلی هیاهو داره و شلوغه',
            name: 'رضا شیرازی'
          }
        ]
      },
      {
        id: 8,
        name: 'پردیس سینمایی راگا',
        location: 'شهرری، اتوبان آوینی',
        score: '3.2',
        image: image7,
        features: [
          {
            value: 'کافی شاپ',
            icon: 'mdi-coffee',
          },
          {
            value: 'فود کورت',
            icon: 'mdi-food',
          },
          {
            value: 'پارکینگ',
            icon: 'mdi-parking',
          }

        ],
        contact: '021-55933253',
        description: 'پردیس سینمایی راگا در بهمن 1389 همزمان با برگزاری جشنواره فجر به روی مردم شهرری گشوده شد. در واقع، می‌توان گفت که این سینما اولین سینمای عمومی و رسمی این شهر است. البته پردیس سینمایی راگا تهران، پس از تعطیلی سینماهای معروف شهر ری همچون کانون و مرمر کار خود را آغاز کرد. این پردیس سینمایی در حال حاضر دارای سه سالن با مجموع گنجایش 610 صندلی است که ظرفیت سالن یک 323 صندلی، سالن 2، 147 صندلی و سالن 3، 140 صندلی است.',
        Comments: [
          {
            comment: 'بهترین پردیس سینمایی ،عالیییی',
            name: 'ناشناس'
          },
          {
            comment: 'سلام. سانس های جنگل پرتقال رو بیشتر کنین',
            name: 'نگار'
          },
          {
            comment: 'اگه میشه فیلم فسیل سانسش را بیارید ساعت۱۷',
            name: 'حسام'
          }
        ]
      },
    ]);

    const router = useRouter();

    const goToCinemaDetails = (cinema) => {
      router.push({ name: 'Details', params: { cinema: JSON.stringify(cinema) } });
    };


    return {
      cinemas, goToCinemaDetails
    };
  },
};
</script>

<style scoped>
.cinema-card {
  margin-bottom: 20px;
  box-shadow: 0 2px 4px rgba(0, 0, 0, 0.1);
}

.text-right {
  text-align: right;
}

.cinema-image {
  object-fit: cover;
  height: 200px;
  width: 100%;
}

.item {
  transition: transform .2s;
}

.item:hover {
  transform: scale(1.1);
}
</style>
